"""
2. Реализовать проект расчета суммарного расхода ткани на производство одежды. Основная сущность (класс) этого
проекта — одежда, которая может иметь определенное название. К типам одежды в этом проекте относятся пальто и костюм.
У этих типов одежды существуют параметры: размер (для пальто) и рост (для костюма). size, height
Это могут быть обычные числа: V и H, соответственно.
Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто (V/6.5 + 0.5),
для костюма (2 * H + 0.3). Проверить работу этих методов на реальных данных.
Реализовать общий подсчет расхода ткани. Проверить на практике полученные на этом уроке знания:
реализовать абстрактные классы для основных классов проекта, проверить на практике работу декоратора @property.
"""
from abc import ABC, abstractmethod


class Clothes(ABC):
    @abstractmethod
    def cost(self):
        pass


class Coat(Clothes):
    def __init__(self, v):
        self.V = v

    @property
    def cost(self):
        return self.V / 6.5 + 0.5


class Suit(Clothes):
    def __init__(self, h):
        self.H = h

    @property
    def cost(self):
        return 2 * self.H + 0.3


c = Coat(10)
s = Suit(10)
print(c.cost)
print(s.cost)
